Catalogs/ОсновныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ОсновныеСредства</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изготовитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПаспорта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаводскойНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автотранспорт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКОФ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОсновныхФондов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторТовараЭСФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>34</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ОсновныеСредства/Forms/ФормаГрупповогоДобавления/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодготовитьФормуНаСервере();		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура НачальныйКодПриИзменении(Элемент)
	УстановитьКонечныйКод(НачальныйКод, КонечныйКод, Количество);
КонецПроцедуры

&НаКлиенте
Процедура НачальныйКодРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Направление = 1 И НЕ ЗначениеЗаполнено(НачальныйКод) Тогда
		НачальныйКод = 1;		
	Иначе
		НачальныйКод = УвеличитьКодНаСервере(НачальныйКод, Направление);		
	КонецЕсли;
	
	УстановитьКонечныйКод(НачальныйКод, КонечныйКод, Количество);
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	УстановитьКонечныйКод(НачальныйКод, КонечныйКод, Количество);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	НовоеЗначение = Количество + Направление;
	ЧисловаяЧасть = ПолучитьЧисловуюЧастьНаСервере(НачальныйКод);
	
	Если ЗначениеЗаполнено(ЧисловаяЧасть) И Направление = 1 Тогда
		СтандартнаяОбработка = (НовоеЗначение <= МаксимумСоздаваемыхОбъектов(ЧисловаяЧасть));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если ПустаяСтрока(НаименованиеПолное) Тогда
		НаименованиеПолное = Наименование;	
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Добавить(Команда)
	
	Отказ = Ложь;
	
	Если НЕ ЗначениеЗаполнено(НачальныйКод) Тогда
		ТекстСообщения = НСтр("ru='Не заполнено поле ""Присваивать коды, начиная с"".'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "НачальныйКод"); 
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Количество) Тогда
		ТекстСообщения = НСтр("ru='Не заполнено поле ""Количество создаваемых объектов"".'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Количество");
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		ТекстСообщения = НСтр("ru='Не заполнено поле ""Наименование"".'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Наименование");
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЧисловаяЧасть = ПолучитьЧисловуюЧастьНаСервере(НачальныйКод);
	
	Если НЕ ЗначениеЗаполнено(ЧисловаяЧасть) Тогда
		ТекстСообщения = НСтр("ru='Начальный код, указанный в поле ""Присваивать коды с:"", не содержит числовой части.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "НачальныйКод"); 
		Возврат;
	КонецЕсли;
	
	Если Количество > МаксимумСоздаваемыхОбъектов(ЧисловаяЧасть) Тогда
		ТекстСообщения = НСтр("ru='Введенное количество объектов превышает допустимое исходя из заданной разрядности начального номера.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Количество");
		Возврат;
	КонецЕсли;
	
	Элементы.ОжиданиеОбработки.Видимость = Истина;
	Элементы.ГруппаПараметры.Видимость   = Ложь;
	
	ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаДобавить.Видимость = Ложь;
	ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаЗакрыть.Видимость  = Ложь;
	
	ПодключитьОбработчикОжидания("ПерейтиНаСтраницуИзмененияОбъектов", 0.1, Истина);
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ПодготовитьФормуНаСервере()

	НовыйЭлемент = Справочники.ОсновныеСредства.СоздатьЭлемент();
	НовыйЭлемент.УстановитьНовыйКод();
	
	НачальныйКод = НовыйЭлемент.Код;
    УстановитьКонечныйКод(НачальныйКод, КонечныйКод, Количество);
	
	Если НЕ (Параметры.ОсновноеСредство = Неопределено) И (ТипЗнч(Параметры.ОсновноеСредство) = Тип("СправочникСсылка.ОсновныеСредства")) Тогда
		Группа = Параметры.ОсновноеСредство.Родитель;
	КонецЕсли;
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаПараметры;
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьКонечныйКод(НачальныйКод, КонечныйКод, КоличествоОбъектов)
	
	ЧисловаяЧасть = Справочники.ОсновныеСредства.ПолучитьЧисловуюЧасть(НачальныйКод);
	
	Если НЕ ЗначениеЗаполнено(НачальныйКод) 
	 ИЛИ НЕ ЗначениеЗаполнено(ЧисловаяЧасть)
	 ИЛИ КоличествоОбъектов <= 0 
	 ИЛИ КоличествоОбъектов > МаксимумСоздаваемыхОбъектов(ЧисловаяЧасть) Тогда
		
		КонечныйКод = "";
		Возврат;
		
	КонецЕсли;
	
	КонечныйКод = Справочники.ОсновныеСредства.УвеличитьКод(НачальныйКод, КоличествоОбъектов - 1);
			
КонецПроцедуры

&НаСервереБезКонтекста
Функция МаксимумСоздаваемыхОбъектов(ЧисловаяЧасть)
	
	Если ЗначениеЗаполнено(ЧисловаяЧасть) Тогда
		Возврат Pow(10, СтрДлина(ЧисловаяЧасть)) - Число(ЧисловаяЧасть);
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПерейтиНаСтраницуИзмененияОбъектов()
	
	ДобавитьНаСервере();
	
	Если РезультатФоновогоЗадания.ЗаданиеВыполнено Тогда
		ПоказатьСообщениеОЗавершении();
	Иначе
		ПодключитьОбработчикОжидания("ПроверитьВыполнениеИзменения", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ДобавитьНаСервере()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Количество",         Количество);
	СтруктураПараметров.Вставить("НачальныйКод",       НачальныйКод);
	СтруктураПараметров.Вставить("Родитель",           Группа);
	СтруктураПараметров.Вставить("Наименование",       Наименование);
	СтруктураПараметров.Вставить("НаименованиеПолное", НаименованиеПолное);
	СтруктураПараметров.Вставить("Изготовитель",       Изготовитель);
	СтруктураПараметров.Вставить("ЗаводскойНомер",     ЗаводскойНомер);
	СтруктураПараметров.Вставить("НомерПаспорта",      НомерПаспорта);
	СтруктураПараметров.Вставить("ДатаВыпуска",        ДатаВыпуска);
	СтруктураПараметров.Вставить("ГруппаОС",           ГруппаОС);
	СтруктураПараметров.Вставить("Автотранспорт",      Автотранспорт);
	СтруктураПараметров.Вставить("КодКОФ",             КодКОФ);
	
	НаименованиеЗадания = НСтр("ru = 'Групповое создание элементов'");
		
	ВыполняемыйМетод = "Справочники.ОсновныеСредства.ВыполнитьСозданиеОбъектов";
	СтруктураПараметров = Новый Структура("ИмяОбработки, ИмяМетода, ПараметрыВыполнения, ЭтоВнешняяОбработка, ДополнительнаяОбработкаСсылка",
		"ОсновныеСредства", "ВыполнитьСозданиеОбъектов", СтруктураПараметров, Ложь, "");
		
	РезультатФоновогоЗадания = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
			УникальныйИдентификатор,
			ВыполняемыйМетод,
			СтруктураПараметров, 
			НаименованиеЗадания);
		
КонецПроцедуры 

&НаКлиенте
Процедура ПроверитьВыполнениеИзменения()
	
	Попытка
		РезультатФоновогоЗадания.ЗаданиеВыполнено = ЗаданиеВыполнено(РезультатФоновогоЗадания.ИдентификаторЗадания);
	Исключение
		ПерейтиНаСтраницуИзмененияОбъектов();
		ВызватьИсключение;
	КонецПопытки;
	
	Если РезультатФоновогоЗадания.ЗаданиеВыполнено Тогда
		ПоказатьСообщениеОЗавершении();
	Иначе
		ПодключитьОбработчикОжидания("ПроверитьВыполнениеИзменения", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
КонецФункции

&НаКлиенте
Процедура ПоказатьСообщениеОЗавершении()
	
	Элементы.ОжиданиеОбработки.Видимость = Ложь;
	Элементы.ГруппаПараметры.Видимость   = Истина;
	
	ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаДобавить.Видимость = Истина;
	ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаЗакрыть.Видимость  = Истина;
	
	ТекстСообщения = НСтр("ru='Создание основных средств завершено'");
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
	Этаформа.ВладелецФормы.Элементы.Список.Обновить();
	
КонецПроцедуры

 &НаСервереБезКонтекста
Функция УвеличитьКодНаСервере(НачальныйКод, Направление)
 	Возврат Справочники.ОсновныеСредства.УвеличитьКод(НачальныйКод, Направление);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЧисловуюЧастьНаСервере(НачальныйКод)
	Возврат Справочники.ОсновныеСредства.ПолучитьЧисловуюЧасть(НачальныйКод);
КонецФункции
